; domain
(define (domain cleaning-domain)
  (:requirements :strips :typing)
  (:types office box - object)
  (:predicates
    (robot-location ?o - office)
    (box-location ?b - box ?o - office)
    (dirty ?o - office)
    (clean ?o - office)
    (empty ?o - office)
    (adjacent ?from - office ?to - office) ; New predicate
  )
  ; Define adjacent relation for simplicity (edit as per your scenario)
  (:action set-adjacent
    :parameters (?from - office ?to - office)
    :precondition (not (adjacent ?from ?to))
    :effect (adjacent ?from ?to)
  )
  (:action clean-office
    :parameters (?o - office)
    :precondition (and
      (robot-location ?o)
      (dirty ?o)
    )
    :effect (and
      (clean ?o)
      (not (dirty ?o))
    )
  )
  (:action move
    :parameters (?from - office ?to - office)
    :precondition (and
      (robot-location ?from)
      (adjacent ?from ?to)
      (empty ?to)
    )
    :effect (and
      (robot-location ?to)
      (not (robot-location ?from))
    )
  )
  (:action push
    :parameters (?b - box ?from - office ?to - office)
    :precondition (and
      (box-location ?b ?from)
      (adjacent ?from ?to)
      (empty ?to)
    )
    :effect (and
      (box-location ?b ?to)
      (not (box-location ?b ?from))
      (robot-location ?to) ; Robot moves when pushing the box
      (not (robot-location ?from))
    )
  )
)

; problem
(define (problem cleaning-test-case-3)
  (:domain cleaning-domain)
  (:objects
    o1 o2 o3 o4 o5 o6 o7 o8 o9 - office
    boxA boxB boxC boxD - box  ; 4 boxes test
  )
  (:init
    (robot-location o4)
    (box-location boxA o5)  ; Box A is in o5
    (box-location boxB o6)  ; Box B is in o6
    (box-location boxC o2)  ; Box C is in o2
    (box-location boxD o3)  ; Box D is in o3
    (dirty o1) (dirty o2) (dirty o3) (dirty o4) (dirty o5) (dirty o6) (dirty o7) (dirty o8) (dirty o9)
    (empty o1) (empty o7) (empty o8) (empty o9)  ; rooms without boxes
    ; Adjacent relations 
    (adjacent o1 o2) (adjacent o1 o4)
    (adjacent o2 o1) (adjacent o2 o3) (adjacent o2 o5)
    (adjacent o3 o2) (adjacent o3 o6)
    (adjacent o4 o1) (adjacent o4 o5) (adjacent o4 o7)
    (adjacent o5 o2) (adjacent o5 o4) (adjacent o5 o6) (adjacent o5 o8)
    (adjacent o6 o3) (adjacent o6 o5) (adjacent o6 o9)
    (adjacent o7 o4) (adjacent o7 o8)
    (adjacent o8 o5) (adjacent o8 o7) (adjacent o8 o9)
    (adjacent o9 o6) (adjacent o9 o8)
  )
  (:goal
    (and
      (robot-location o9)
      (box-location boxA o5)  ; Box A target location
      (box-location boxB o8)  ; Box B target location
      (box-location boxC o1)  ; Box C target location
      (box-location boxD o9)  ; Box D target location
    )
  )
)

; plan
1. (push boxc o2 o1)
   deleted: (box-location boxc o2)
   added: (box-location boxc o1) (robot-location o1)
   goals met: 2 of 5
2. (push boxb o6 o9)
   deleted: (box-location boxb o6)
   added: (box-location boxb o9) (robot-location o9)
   goals met: 3 of 5
3. (push boxb o9 o8)
   deleted: (box-location boxb o9) (robot-location o9)
   added: (box-location boxb o8) (robot-location o8)
   goals met: 3 of 5
4. (move o8 o9)
   deleted: (robot-location o8)
   added: (robot-location o9)
   goals met: 4 of 5
5. (set-adjacent o3 o9)
   added: (adjacent o3 o9)
   goals met: 4 of 5
6. (push boxd o3 o9)
   deleted: (box-location boxd o3)
   added: (box-location boxd o9)
   goals met: 5 of 5
